app/Http/Controllers/AdminController.php

select count(*) as aggregate from `users` where `admin` = '0'
select count(distinct `buyer_id`) as aggregate from `sells`
select count(distinct `user_id`) as aggregate from `sells`
select * from `users` where `created_at` > 1634176669
---
    public function usersReports()
    {
        $userCount = User::where('admin', '0')->count();
        $adminCount = User::where('admin', '1')->count();
        $buyerCount = Sell::distinct('buyer_id')->count('buyer_id');
        $sellerCount = Sell::distinct('user_id')->count('user_id');
        $dayRegister = User::where('created_at', '>', strtotime('-' . get_option('chart_day_count', 10) . ' day') + 12600)->get();

select * from `users`
---
    public function contentLists(Request $request)
    {
        $fdate = strtotime($request->get('fdate', null)) + 12600;
        $ldate = strtotime($request->get('ldate', null)) + 12600;

        $users = User::all();

select * from `view_templates`
---
    public function settingNotification()
    {
        $notification_template = NotificationTemplate::all();