app/Http/Controllers/WebController.php

select * from `contents` where `mode` = 'publish' and `type` LIKE '%webinar%' order by `id` desc limit 10
select * from `users` where `users`.`id` in (108, 117)
---
    private function getLiveContents()
    {
        $contents = Content::where('mode', 'publish')->orderBy('id', 'DESC')->limit(10)
            ->with('metas', 'user')
            ->where('type', 'LIKE', '%webinar%');

        return $contents->get();

select * from `contents` where `mode` = 'publish' order by `id` desc limit 10
select * from `users` where `users`.`id` in (108, 110, 111, 112, 113, 114, 115, 116, 117)
---
    private function getContents($tag, $orderByName, $orderByValue, $withCount = null, $limit = 10)
    {
        $query = Content::where('mode', 'publish')
            ->orderBy($orderByName, $orderByValue)
            ->limit($limit)
            ->with('metas', 'user');

        if (!empty($withCount)) {
            $query->withCount($withCount);
        }

        return $query->get();

select * from `contents` where `contents`.`id` in (100018)
select * from `users` where `users`.`id` in (108)
---
    private function getContentVip()
    {
        $vipContentQuery = $this->getContentVipQuery();
        return $vipContentQuery->with('content.user')->get();

select * from `contents` where `contents`.`id` in (100018)
select * from `users` where `users`.`id` in (108)
---
    private function getSliderContainer()
    {
        $vipContentQuery = $this->getContentVipQuery();
        return $vipContentQuery->with(['content' => function ($query) {
            $query->with(['metas', 'user']);
        }])->get();

select * from `article` where `mode` = 'publish' order by `id` desc limit 4
---
    private function getArticlePosts()
    {
        return Article::where('mode', 'publish')
            ->orderBy('id', 'DESC')
            ->limit(get_option('main_page_article_post_count', 1))
            ->get();

select `users`.*, (select count(*) from `contents` where `users`.`id` = `contents`.`user_id` and `mode` = 'publish') as `contents_count` from `users` where `mode` = 'active' and `admin` = '0' order by `contents_count` desc limit 4
---
    private function getUsersMostContent()
    {
        $userQuery = $this->getUserQuery();
        return $userQuery->withCount(['contents' => function ($query) {
            $query->where('mode', 'publish');
        }])
            ->with(['usermetas'])
            ->orderBy('contents_count', 'DESC')
            ->limit(4)
            ->get();

select * from `user_channel` where `mode` = 'active' order by `id` desc limit 4
select * from `user_channel` where `mode` = 'active' order by `id` desc, `view` desc limit 4
select `users`.*, (select count(*) from `follow` where `users`.`id` = `follow`.`user_id`) as `follow_count` from `users` where `users`.`id` in (109, 111, 112, 117)
---
    private function getChannels()
    {
        $channelsQuery = Channel::where('mode', 'active');

        $channels['new'] = $channelsQuery->orderBy('id', 'DESC')
            ->limit(4)
            ->get();

        $channels['view'] = $channelsQuery->orderBy('view', 'DESC')
            ->limit(4)
            ->get();

        $channels['popular'] = $channelsQuery->with(['user' => function ($query) {
            $query->withCount(['follow']);
        }])
            ->get()
            ->sortByDesc('user.followCount');

select * from `contents` where `id` = '13' and `mode` = 'publish' limit 1
select count(*) as aggregate from `sells` where `buyer_id` = 143 and `content_id` = '13'
select * from `contents` where `contents`.`user_id` in (110) and `mode` = 'publish' limit 3
select * from `favorite` where `favorite`.`content_id` in (13) and `user_id` = 3
select * from `point` where `point`.`user_id` in (110)
select * from `users` where `users`.`id` in (110)
select * from `quizzes` where `quizzes`.`content_id` in (13) and `status` = 'active'
---
    public function product($id)
    {
        error_reporting(0);
        $user = (auth()->check()) ? auth()->user() : null;

        $content = Content::where('id', $id)->where('mode', 'publish')->first();
        if (empty($content)) {
            return back();
        }

        $buy = Sell::where('buyer_id', $user->id)->where('content_id', $id)->count();

        $product = $content->withCount(['comments' => function ($q) {
            $q->where('mode', 'publish');
        }])->with(['meetings', 'discount', 'category' => function ($c) use ($content, $id) {
            $c->with(['discount' => function ($dc) use ($id, $content) {
                $dc->where('off_id', $content->category->id);
            }]);
        }, 'rates', 'user' => function ($u) {
            $u->with(['usermetas', 'point', 'contents' => function ($cQuery) {
                $cQuery->where('mode', 'publish')->limit(3);
            }]);
        }, 'metas', 'parts' => function ($query) {
            $query->where('mode', 'publish')->orderBy('sort');
        }, 'favorite' => function ($fquery) use ($user) {
            $fquery->where('user_id', $user->id);
        }, 'comments' => function ($ccquery) use ($id) {
            $ccquery->where('mode', 'publish')->with(['user' => function ($uquery) use ($id) {
                $uquery->with(['category', 'usermetas'])->withCount(['buys' => function ($buysq) use ($id) {
                    $buysq->where('content_id', $id);
                }, 'contents' => function ($contentq) use ($id) {
                    $contentq->where('id', $id);
                }]);
            }, 'childs' => function ($cccquery) use ($id) {
                $cccquery->where('mode', 'publish')->with(['user' => function ($cuquery) use ($id) {
                    $cuquery->with(['category', 'usermetas'])->withCount(['buys' => function ($buysq) use ($id) {
                        $buysq->where('content_id', $id);
                    }, 'contents' => function ($contentq) use ($id) {
                        $contentq->where('id', $id);
                    }]);
                }]);
            }]);
        }, 'supports' => function ($q) use ($user) {
            $q->with(['user.usermetas', 'supporter.usermetas', 'sender.usermetas'])->where('sender_id', $user->id)->where('mode', 'publish')->orderBy('id', 'DESC');
        }, 'quizzes' => function ($q) {
            $q->where('status', 'active');
        },
        ])->find($id);

select * from `contents` where `category_id` = 10 and `id` <> 13 and `mode` = 'publish' order by RAND() limit 3
---

        ## Get Related Content ##
        $relatedCat = $product->category_id;
        $relatedContent = Content::with(['metas'])
            ->where('category_id', $relatedCat)
            ->where('id', '<>', $product->id)
            ->where('mode', 'publish')
            ->limit(3)
            ->inRandomOrder()
            ->get();

select * from `contents` where `mode` = 'publish' and `id` in ('5', '6', '7')
---
        $preCousreContent = null;
        if (isset($meta['precourse'])) {
            $preCourseIDs = explode(',', rtrim($meta['precourse'], ','));
            $preCousreContent = Content::where('mode', 'publish')
                ->whereIn('id', $preCourseIDs)
                ->get();